{
  "taskId": "ОМ-02",
  "taskGoal": "",
  "develops": [
    {
      "skillName": "Особенности мобильного тестирования",
      "fromLevel": 1,
      "toLevel": 2
    }
  ],
  "subTasks": [
    {
      "title": "Освежить знания о дебаг экранах [Debug-screen](/display/QA/Debug-screen)",
      "description": "Освежить знания о дебаг экранах [Debug-screen](/display/QA/Debug-screen)"
    },
    {
      "title": "Изучить <https://habr.com/ru/companies/atisu/articles/598389/> статью про Дебаг...",
      "description": "Изучить <https://habr.com/ru/companies/atisu/articles/598389/> статью про Дебаг экран в Flutter. Разобраться чем отличается Flutter от Native"
    },
    {
      "title": "Выписать не менее 5 полезных применений в тестировании для дебаг экрана Утечки...",
      "description": "Выписать не менее 5 полезных применений в тестировании для дебаг экрана Утечки памяти:"
    },
    {
      "title": "Изучить <https://habr.com/ru/companies/ozontech/articles/815041/> статью про...",
      "description": "Изучить <https://habr.com/ru/companies/ozontech/articles/815041/> статью про тестирование утечек памяти. По необходимости искать дополнительную инфу по конкретным инструментам"
    },
    {
      "title": "На примере проекта студии попробовать использовать LeakCanary и найти утечку...",
      "description": "На примере проекта студии попробовать использовать LeakCanary и найти утечку (если за полчаса не найдется то попробовать другое приложение)."
    },
    {
      "title": "Проанализировать утечку и выделить артефакты для баг-репорта",
      "description": "Проанализировать утечку и выделить артефакты для баг-репорта. По необходимости передать баг репорт QA"
    },
    {
      "title": "Похожим образом пройтись по iOS и Flutter приложениям с помощью профилировщика...",
      "description": "Похожим образом пройтись по iOS и Flutter приложениям с помощью профилировщика памяти для ознакомления с инструментами. Геолокация:"
    },
    {
      "title": "Освежить знания [Подмена геолокации](/pages/viewpage.action?pageId=2396518)",
      "description": "Освежить знания [Подмена геолокации](/pages/viewpage.action?pageId=2396518)"
    },
    {
      "title": "Последовательно подменить и проверить успех на Андроиде (девайс и эмулятор) и...",
      "description": "Последовательно подменить и проверить успех на Андроиде (девайс и эмулятор) и iOS симуляторе Тестирование верстки:"
    },
    {
      "title": "Изучить [Window Visual Quality...",
      "description": "Изучить [Window Visual Quality Assurance](/display/QA/Window+Visual+Quality+Assurance) и установить на Android данный инструмент"
    },
    {
      "title": "В нативном приложении Android проверить возможность измерять отступы между...",
      "description": "В нативном приложении Android проверить возможность измерять отступы между элементами"
    },
    {
      "title": "Для Flutter приложений собрать сборку студийного приложения и через инспектор...",
      "description": "Для Flutter приложений собрать сборку студийного приложения и через инспектор проверить отступы"
    }
  ],
  "artifacts": [
    {
      "name": "Документация по Особенности мобильного тестирования",
      "url": "#"
    },
    {
      "name": "Практические примеры Особенности мобильного тестирования",
      "url": "#"
    }
  ],
  "expectedResult": "Применяю знания • Понимаю отличия Debug-screen на разных платформах и особенности их реализации • Аргументирую необходимость Debug-screen на проекте или его доработок (например, сделать чтобы прокси запоминался на Flutter для тестирования запросов на старте приложения) • Тестирую утечки памяти • Тестирую геолокацию с помощью подмены на всех платформах (и на симуляторах) • Тестирую верстку приложений с помощью различных инструментов",
  "estimatedTime": "8 часов"
}