{
  "taskId": "ОИ-02",
  "taskGoal": "Улучшить навык определения причин ошибок по логам тестов",
  "develops": [
    {
      "skillName": "Отчеты и интеграция с TMS",
      "fromLevel": 1,
      "toLevel": 2
    }
  ],
  "subTasks": [
    {
      "title": "Паттерны - повторяющиеся логи и их причины",
      "description": "Паттерны - повторяющиеся логи и их причины. Фиксировать своё понимание о том, что эти логи значат и почему"
    },
    {
      "title": "Корреляции между разными логами, например ошибка в логе теста может быть более...",
      "description": "Корреляции между разными логами, например ошибка в логе теста может быть более подробно описана или вызвана ошибкой в логах аппиума."
    },
    {
      "title": "Время событий и/или их последовательность",
      "description": "Время событий и/или их последовательность. Т.к. логи зачастую отражают последовательность событий, по логам можно восстановить порядок этих событий и проанализировать корректный ли он."
    },
    {
      "title": "Поиск ключевых событий",
      "description": "Поиск ключевых событий. Например, при падении “не найден элемент” имеет смысл найти этот элемент в логах и посмотреть выше него что привело к тому что он не был найден."
    },
    {
      "title": "Стектрейсы - если лог содержит последовательность вызовов, важно локализовать...",
      "description": "Стектрейсы - если лог содержит последовательность вызовов, важно локализовать точку в коде где произошла проблема. Важно использовать вместе с пунктом про последовательность событий чтобы определить источник ошибки."
    },
    {
      "title": "Создание гипотез о причинах",
      "description": "Создание гипотез о причинах. Цель любого анализа логов - гипотеза и потом решение которое поможет подтвердить или опровергнуть гипотезу посредством теста. Важно формировать гипотезы на всех предыдущих данных."
    }
  ],
  "artifacts": [
    {
      "name": "Практические примеры Отчеты и интеграция с TMS",
      "url": "#"
    }
  ],
  "expectedResult": "Уверенный анализ логов, уменьшение времязатрат на анализ логов на 10%",
  "estimatedTime": "40 часов",
  "comment": "Логи тоже часть анализа отчетов"
}